log/nginx-400.log
Start web server....
docker run -d --name=web -v `pwd`/data:/usr/share/nginx/html -v `pwd`/dockerfile/nginx/nginx.conf:/etc/nginx/nginx.conf -p 80:80 nginx 
dea6fd3ab13395ae8298e91ef6a326040af577b0ed91dff978668834f0c07ef5

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=60s -rate 400  | tee results.bin | vegeta report
Requests      [total, rate]            24000, 400.02
Duration      [total, attack, wait]    59.999192s, 59.997499s, 1.693ms
Latencies     [mean, 50, 95, 99, max]  1.771729ms, 1.715ms, 2.148ms, 2.642ms, 25.617ms
Bytes In      [total, mean]            216792000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:24000  
Error Set:

Kill web server....
docker rm -f web
web