log/nginx-400.log
Start web server....
docker run -d --name=web -v `pwd`/nginx-log:/log -p 80:80 -p 7890:7890 peihsinsu/nginx 
c7be5e489376ec9cab5aca8d83d493062bab5ceb9550c4bb5560553ef9cc89c0

Fire vegeta....
echo "GET http://localhost/pic.png" | vegeta attack -duration=30s -rate 400  | tee results.bin | vegeta report
Requests      [total, rate]            12000, 400.03
Duration      [total, attack, wait]    29.99863s, 29.997499s, 1.131ms
Latencies     [mean, 50, 95, 99, max]  1.166652ms, 1.11ms, 1.53ms, 2.074ms, 20.727ms
Bytes In      [total, mean]            108396000, 9033.00
Bytes Out     [total, mean]            0, 0.00
Success       [ratio]                  100.00%
Status Codes  [code:count]             200:12000  
Error Set:

Kill web server....
docker rm -f web
web